In [1]:
!pip install SQLAlchemy==2.0.29

Collecting SQLAlchemy==2.0.29
  Downloading SQLAlchemy-2.0.29-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (9.6 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.12/site-packages (from SQLAlchemy==2.0.29) (4.15.0)
Collecting greenlet!=0.4.17 (from SQLAlchemy==2.0.29)
  Downloading greenlet-3.3.0-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (4.1 kB)
Downloading SQLAlchemy-2.0.29-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.2/3.2 MB 23.9 MB/s  0:00:00
Downloading greenlet-3.3.0-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (609 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 609.9/609.9 kB 25.5 MB/s  0:00:00
Installing collected packages: greenlet, SQLAlchemy
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [SQLAlchemy]2 [SQLAlchemy]
Successfully installed SQLAlchemy-2.0.29 greenlet-3.3.0

In [2]:
!pip install mysql-connector-python==8.3.0

Collecting mysql-connector-python==8.3.0
  Downloading mysql_connector_python-8.3.0-cp312-cp312-manylinux_2_17_x86_64.whl.metadata (1.9 kB)
Downloading mysql_connector_python-8.3.0-cp312-cp312-manylinux_2_17_x86_64.whl (21.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.5/21.5 MB 30.3 MB/s  0:00:00m0:00:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

In [3]:
!pip install mysqlclient==2.2.4

Collecting mysqlclient==2.2.4
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp312-cp312-linux_x86_64.whl size=133331 sha256=7e299afd23931ea09b635bc04137c61371a9412bfcb2912757c9031bce0b096c
  Stored in directory: /home/codespace/.cache/pip/wheels/20/6f/c3/3b23bb01988b1c0bea0668e2116315ce43ced2179724ab593e
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

In [5]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (91 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.3.5-cp312-cp312-manylinux_2_27_x86_64.manylinux_2_28_x86_64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (12.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.4/12.4 MB 24.8 MB/s  0:00:00m0:00:010:01
Downloading numpy-2.3.5-cp312-cp312-manylinux_2_27_x86_64.manylinux_2_28_x86_64.whl (16.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 16.6/16.6 MB 44.7 MB/s  0:00:006m0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, numpy, pandas
   ━━━━━━━━━━━━━╺━━━━━━━━━━━━━━━━━━━━━━━━━━ 1/3 [numpy]  WARNING: The scripts f2py and numpy-config are installed in '/usr/local/python/3.12.1/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed numpy-2.3.5 pandas-2.3.3 pytz-2025.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import pandas as pd # Libreria pandas
import sqlalchemy as db

# from sqlalchemy import text

In [7]:
# Crear una conexion 
# Cadena: usuario, clave, host o servidor, puerto, nombre de la BD
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/db_movies_netflix_transact")

# Establecemos o iniciamos la conexion
conn = engine.connect()

# Cargando datos a la dimension Moview

In [8]:
query = """
SELECT 
    movie.movieID as movieID, movie.movieTitle as title, movie.releaseDate as releaseDate, 
    gender.name as gender , person.name as participantName, participant.participantRole as roleparticipant 
FROM movie 
INNER JOIN participant 
ON movie.movieID=participant.movieID
INNER JOIN person
ON person.personID = participant.personID
INNER JOIN movie_gender 
ON movie.movieID = movie_gender.movieID
INNER JOIN gender 
ON movie_gender.genderID = gender.genderID
"""

In [15]:
# cargar los resultados de la consulta en DF
movies_data = pd.read_sql(query, con=conn)

#Transforamr a Entero
movies_data["movieID"] = movies_data["movieID"].astype('int')

#Mostrar elementos
movies_data

,movieID,title,releaseDate,gender,participantName,roleparticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director

In [24]:
# Cargar un CSV 
movies_awards = pd.read_csv("./data/Awards_movie.csv")

# Transformar el id a entero
movies_awards["movieID"] = movies_awards["movieID"].astype('int')

# Renombrar la columna premio
movies_awards.rename(columns={"Aware": "Award"}, inplace = True) 

movies_awards

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [25]:

# Cruzar ( join )
movie_data_final = pd.merge(movies_data, movies_awards,
                            left_on="movieID", right_on="movieID")

movie_data_final

,movieID,title,releaseDate,gender,participantName,roleparticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,1,Grammy

In [27]:
# Crear una conexion a la BD ware
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/dw_netflix")

conn_dw = engine.connect()

In [28]:
# Renombrar 2 columnas
movie_data_final = movie_data_final.rename(columns={"releaseDate":"releaseMovie", "Award":"awardMovie"})

# eliminar un campo
movie_data_final = movie_data_final.drop(columns=['IdAward'])

In [29]:
movie_data_final

,movieID,title,releaseMovie,gender,participantName,roleparticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [30]:
movie_data_final.to_sql('dimMovie', conn_dw, if_exists='append', index= False)

3

# Cargar Dimension USER

In [37]:
#Cargado la tabla usuario
users = pd.read_csv('./data/users.csv', sep = '|')

users.head()

    idUser     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [41]:
users = users.rename(columns = {'idUser': 'userID'})

users.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [42]:
# ingestar a la BD
users.to_sql('dimUser', conn_dw, if_exists='append', index= False)

20

# Cargamos datos a la tabla echos

In [43]:
users_id = users['userID']

moives_id = movie_data_final['movieID']

In [44]:
users_id.head()

0    1002331
1    1002332
2    1002333
3    1002334
4    1002335
Name: userID, dtype: int64

In [45]:
moives_id.head()

0    80192187
1    80210920
2    81157374
Name: movieID, dtype: int64

In [46]:
whatchs_data =  pd.merge(users_id, moives_id, how='cross')

whatchs_data

      userID   movieID
0    1002331  80192187
1    1002331  80210920
2    1002331  81157374
3    1002332  80192187
4    1002332  80210920
5    1002332  81157374
6    1002333  80192187
7    1002333  80210920
8    1002333  81157374
9    1002334  80192187
10   1002334  80210920
11   1002334  81157374
12   1002335  80192187
13   1002335  80210920
14   1002335  81157374
15   1002336  80192187
16   1002336  80210920
17   1002336  81157374
18   1002337  80192187
19   1002337  80210920
20   1002337  81157374
21   1002338  80192187
22   1002338  80210920
23   1002338  81157374
24   1002339  80192187
25   1002339  80210920
26   1002339  81157374
27  10023310  80192187
28  10023310  80210920
29  10023310  81157374
30  10023311  80192187
31  10023311  80210920
32  10023311  81157374
33  10023312  80192187
34  10023312  80210920
35  10023312  81157374
36  10023313  80192187
37  10023313  80210920
38  10023313  81157374
39  10023314  80192187
40  10023314  80210920
41  10023314  81157374
42  10023315  80192187
43  10023315  80210920
44  10023315  81157374
45  10023316  80192187
46  10023316  80210920
47  10023316  81157374
48  10023317  80192187
49  10023317  80210920
50  10023317  81157374
51  10023318  80192187
52  10023318  80210920
53  10023318  81157374
54  10023319  80192187
55  10023319  80210920
56  10023319  81157374
57  10023320  80192187
58  10023320  80210920
59  10023320  81157374

In [47]:
import random
from datetime import datetime, timedelta

def gen_rating():
    numero_aleatorio = round(random.uniform(0, 5), 1)

    return numero_aleatorio

def gen_timestamp():
    start_date = datetime(2024, 1, 15)
    end_date = datetime(2024, 4, 6)

    random_date = start_date + timedelta(seconds=random.randint(0, int((end_date - start_date).total_seconds())))

    return random_date

In [54]:
whatchs_data['rating'] = whatchs_data['movieID'].apply(lambda x: gen_rating())

whatchs_data['timestamp'] = whatchs_data['userID'].apply(lambda x: gen_timestamp())

In [55]:
whatchs_data.head()

    userID   movieID  rating           timestamp
0  1002331  80192187     4.8 2024-02-15 14:23:47
1  1002331  80210920     0.6 2024-03-06 20:38:32
2  1002331  81157374     4.4 2024-01-18 08:02:47
3  1002332  80192187     3.1 2024-03-21 19:18:38
4  1002332  80210920     1.2 2024-02-03 01:58:44

In [57]:
#cargar la data
whatchs_data.to_sql('FactWatchs', conn_dw, if_exists='append', index=False)

60